{"format": "layers-model", "generatedBy": "keras v2.8.0", "convertedBy": "TensorFlow.js Converter v3.15.0", "modelTopology": {"keras_version": "2.8.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_3", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [1, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "embedding_3_input"}}, {"class_name": "Embedding", "config": {"name": "embedding_3", "trainable": true, "batch_input_shape": [1, null], "dtype": "float32", "input_dim": 95, "output_dim": 512, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}}, {"class_name": "LSTM", "config": {"name": "lstm_6", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": true, "unroll": false, "time_major": false, "units": 2048, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, {"class_name": "LSTM", "config": {"name": "lstm_7", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": true, "unroll": false, "time_major": false, "units": 2048, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 95, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}}, "weightsManifest": [{"paths": ["group1-shard1of53.bin", "group1-shard2of53.bin", "group1-shard3of53.bin", "group1-shard4of53.bin", "group1-shard5of53.bin", "group1-shard6of53.bin", "group1-shard7of53.bin", "group1-shard8of53.bin", "group1-shard9of53.bin", "group1-shard10of53.bin", "group1-shard11of53.bin", "group1-shard12of53.bin", "group1-shard13of53.bin", "group1-shard14of53.bin", "group1-shard15of53.bin", "group1-shard16of53.bin", "group1-shard17of53.bin", "group1-shard18of53.bin", "group1-shard19of53.bin", "group1-shard20of53.bin", "group1-shard21of53.bin", "group1-shard22of53.bin", "group1-shard23of53.bin", "group1-shard24of53.bin", "group1-shard25of53.bin", "group1-shard26of53.bin", "group1-shard27of53.bin", "group1-shard28of53.bin", "group1-shard29of53.bin", "group1-shard30of53.bin", "group1-shard31of53.bin", "group1-shard32of53.bin", "group1-shard33of53.bin", "group1-shard34of53.bin", "group1-shard35of53.bin", "group1-shard36of53.bin", "group1-shard37of53.bin", "group1-shard38of53.bin", "group1-shard39of53.bin", "group1-shard40of53.bin", "group1-shard41of53.bin", "group1-shard42of53.bin", "group1-shard43of53.bin", "group1-shard44of53.bin", "group1-shard45of53.bin", "group1-shard46of53.bin", "group1-shard47of53.bin", "group1-shard48of53.bin", "group1-shard49of53.bin", "group1-shard50of53.bin", "group1-shard51of53.bin", "group1-shard52of53.bin", "group1-shard53of53.bin"], "weights": [{"name": "dense_3/kernel", "shape": [2048, 95], "dtype": "float32"}, {"name": "dense_3/bias", "shape": [95], "dtype": "float32"}, {"name": "embedding_3/embeddings", "shape": [95, 512], "dtype": "float32"}, {"name": "lstm_6/lstm_cell/kernel", "shape": [512, 8192], "dtype": "float32"}, {"name": "lstm_6/lstm_cell/recurrent_kernel", "shape": [2048, 8192], "dtype": "float32"}, {"name": "lstm_6/lstm_cell/bias", "shape": [8192], "dtype": "float32"}, {"name": "lstm_7/lstm_cell_1/kernel", "shape": [2048, 8192], "dtype": "float32"}, {"name": "lstm_7/lstm_cell_1/recurrent_kernel", "shape": [2048, 8192], "dtype": "float32"}, {"name": "lstm_7/lstm_cell_1/bias", "shape": [8192], "dtype": "float32"}]}]}